zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_EIM_2.h
/** Number of instances of the EIM_2 module. */
#define EIM_2_INSTANCE_COUNT                     (1u)

/* EIM_2 - Peripheral instance base addresses */
/** Peripheral EIM_2 base address */
#define IP_EIM_2_BASE                            (0x40514000u)
/** Peripheral EIM_2 base pointer */
#define IP_EIM_2                                 ((EIM_2_Type *)IP_EIM_2_BASE)
/** Array initializer of EIM_2 peripheral base addresses */
#define IP_EIM_2_BASE_ADDRS                      { IP_EIM_2_BASE }
/** Array initializer of EIM_2 peripheral base pointers */
#define IP_EIM_2_BASE_PTRS                       { IP_EIM_2 }

/* ----------------------------------------------------------------------------
   -- EIM_2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_2_Register_Masks EIM_2 Register Masks
 * @{
 */

/*! @name EIMCR - Error Injection Module Configuration Register */
/*! @{ */

#define EIM_2_EIMCR_GEIEN_MASK                   (0x1U)
#define EIM_2_EIMCR_GEIEN_SHIFT                  (0U)
#define EIM_2_EIMCR_GEIEN_WIDTH                  (1U)
#define EIM_2_EIMCR_GEIEN(x)                     (((uint32_t)(((uint32_t)(x)) << EIM_2_EIMCR_GEIEN_SHIFT)) & EIM_2_EIMCR_GEIEN_MASK)
/*! @} */

/*! @name EICHEN - Error Injection Channel Enable register */
/*! @{ */

#define EIM_2_EICHEN_EICH31EN_MASK               (0x1U)
#define EIM_2_EICHEN_EICH31EN_SHIFT              (0U)
#define EIM_2_EICHEN_EICH31EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH31EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH31EN_SHIFT)) & EIM_2_EICHEN_EICH31EN_MASK)

#define EIM_2_EICHEN_EICH30EN_MASK               (0x2U)
#define EIM_2_EICHEN_EICH30EN_SHIFT              (1U)
#define EIM_2_EICHEN_EICH30EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH30EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH30EN_SHIFT)) & EIM_2_EICHEN_EICH30EN_MASK)

#define EIM_2_EICHEN_EICH29EN_MASK               (0x4U)
#define EIM_2_EICHEN_EICH29EN_SHIFT              (2U)
#define EIM_2_EICHEN_EICH29EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH29EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH29EN_SHIFT)) & EIM_2_EICHEN_EICH29EN_MASK)

#define EIM_2_EICHEN_EICH28EN_MASK               (0x8U)
#define EIM_2_EICHEN_EICH28EN_SHIFT              (3U)
#define EIM_2_EICHEN_EICH28EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH28EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH28EN_SHIFT)) & EIM_2_EICHEN_EICH28EN_MASK)

#define EIM_2_EICHEN_EICH27EN_MASK               (0x10U)
#define EIM_2_EICHEN_EICH27EN_SHIFT              (4U)
#define EIM_2_EICHEN_EICH27EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH27EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH27EN_SHIFT)) & EIM_2_EICHEN_EICH27EN_MASK)

#define EIM_2_EICHEN_EICH26EN_MASK               (0x20U)
#define EIM_2_EICHEN_EICH26EN_SHIFT              (5U)
#define EIM_2_EICHEN_EICH26EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH26EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH26EN_SHIFT)) & EIM_2_EICHEN_EICH26EN_MASK)

#define EIM_2_EICHEN_EICH25EN_MASK               (0x40U)
#define EIM_2_EICHEN_EICH25EN_SHIFT              (6U)
#define EIM_2_EICHEN_EICH25EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH25EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH25EN_SHIFT)) & EIM_2_EICHEN_EICH25EN_MASK)

#define EIM_2_EICHEN_EICH24EN_MASK               (0x80U)
#define EIM_2_EICHEN_EICH24EN_SHIFT              (7U)
#define EIM_2_EICHEN_EICH24EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH24EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH24EN_SHIFT)) & EIM_2_EICHEN_EICH24EN_MASK)

#define EIM_2_EICHEN_EICH23EN_MASK               (0x100U)
#define EIM_2_EICHEN_EICH23EN_SHIFT              (8U)
#define EIM_2_EICHEN_EICH23EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH23EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH23EN_SHIFT)) & EIM_2_EICHEN_EICH23EN_MASK)

#define EIM_2_EICHEN_EICH22EN_MASK               (0x200U)
#define EIM_2_EICHEN_EICH22EN_SHIFT              (9U)
#define EIM_2_EICHEN_EICH22EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH22EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH22EN_SHIFT)) & EIM_2_EICHEN_EICH22EN_MASK)

#define EIM_2_EICHEN_EICH21EN_MASK               (0x400U)
#define EIM_2_EICHEN_EICH21EN_SHIFT              (10U)
#define EIM_2_EICHEN_EICH21EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH21EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH21EN_SHIFT)) & EIM_2_EICHEN_EICH21EN_MASK)

#define EIM_2_EICHEN_EICH18EN_MASK               (0x2000U)
#define EIM_2_EICHEN_EICH18EN_SHIFT              (13U)
#define EIM_2_EICHEN_EICH18EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH18EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH18EN_SHIFT)) & EIM_2_EICHEN_EICH18EN_MASK)

#define EIM_2_EICHEN_EICH17EN_MASK               (0x4000U)
#define EIM_2_EICHEN_EICH17EN_SHIFT              (14U)
#define EIM_2_EICHEN_EICH17EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH17EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH17EN_SHIFT)) & EIM_2_EICHEN_EICH17EN_MASK)

#define EIM_2_EICHEN_EICH16EN_MASK               (0x8000U)
#define EIM_2_EICHEN_EICH16EN_SHIFT              (15U)
#define EIM_2_EICHEN_EICH16EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH16EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH16EN_SHIFT)) & EIM_2_EICHEN_EICH16EN_MASK)

#define EIM_2_EICHEN_EICH15EN_MASK               (0x10000U)
#define EIM_2_EICHEN_EICH15EN_SHIFT              (16U)
#define EIM_2_EICHEN_EICH15EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH15EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH15EN_SHIFT)) & EIM_2_EICHEN_EICH15EN_MASK)

#define EIM_2_EICHEN_EICH14EN_MASK               (0x20000U)
#define EIM_2_EICHEN_EICH14EN_SHIFT              (17U)
#define EIM_2_EICHEN_EICH14EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH14EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH14EN_SHIFT)) & EIM_2_EICHEN_EICH14EN_MASK)

#define EIM_2_EICHEN_EICH13EN_MASK               (0x40000U)
#define EIM_2_EICHEN_EICH13EN_SHIFT              (18U)
#define EIM_2_EICHEN_EICH13EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH13EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH13EN_SHIFT)) & EIM_2_EICHEN_EICH13EN_MASK)

#define EIM_2_EICHEN_EICH12EN_MASK               (0x80000U)
#define EIM_2_EICHEN_EICH12EN_SHIFT              (19U)
#define EIM_2_EICHEN_EICH12EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH12EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH12EN_SHIFT)) & EIM_2_EICHEN_EICH12EN_MASK)

#define EIM_2_EICHEN_EICH11EN_MASK               (0x100000U)
#define EIM_2_EICHEN_EICH11EN_SHIFT              (20U)
#define EIM_2_EICHEN_EICH11EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH11EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH11EN_SHIFT)) & EIM_2_EICHEN_EICH11EN_MASK)

