zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_EIM_2.h
#define EIM_2_EICHEN_EICH10EN_MASK               (0x200000U)
#define EIM_2_EICHEN_EICH10EN_SHIFT              (21U)
#define EIM_2_EICHEN_EICH10EN_WIDTH              (1U)
#define EIM_2_EICHEN_EICH10EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH10EN_SHIFT)) & EIM_2_EICHEN_EICH10EN_MASK)

#define EIM_2_EICHEN_EICH9EN_MASK                (0x400000U)
#define EIM_2_EICHEN_EICH9EN_SHIFT               (22U)
#define EIM_2_EICHEN_EICH9EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH9EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH9EN_SHIFT)) & EIM_2_EICHEN_EICH9EN_MASK)

#define EIM_2_EICHEN_EICH8EN_MASK                (0x800000U)
#define EIM_2_EICHEN_EICH8EN_SHIFT               (23U)
#define EIM_2_EICHEN_EICH8EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH8EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH8EN_SHIFT)) & EIM_2_EICHEN_EICH8EN_MASK)

#define EIM_2_EICHEN_EICH7EN_MASK                (0x1000000U)
#define EIM_2_EICHEN_EICH7EN_SHIFT               (24U)
#define EIM_2_EICHEN_EICH7EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH7EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH7EN_SHIFT)) & EIM_2_EICHEN_EICH7EN_MASK)

#define EIM_2_EICHEN_EICH6EN_MASK                (0x2000000U)
#define EIM_2_EICHEN_EICH6EN_SHIFT               (25U)
#define EIM_2_EICHEN_EICH6EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH6EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH6EN_SHIFT)) & EIM_2_EICHEN_EICH6EN_MASK)

#define EIM_2_EICHEN_EICH5EN_MASK                (0x4000000U)
#define EIM_2_EICHEN_EICH5EN_SHIFT               (26U)
#define EIM_2_EICHEN_EICH5EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH5EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH5EN_SHIFT)) & EIM_2_EICHEN_EICH5EN_MASK)

#define EIM_2_EICHEN_EICH4EN_MASK                (0x8000000U)
#define EIM_2_EICHEN_EICH4EN_SHIFT               (27U)
#define EIM_2_EICHEN_EICH4EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH4EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH4EN_SHIFT)) & EIM_2_EICHEN_EICH4EN_MASK)

#define EIM_2_EICHEN_EICH3EN_MASK                (0x10000000U)
#define EIM_2_EICHEN_EICH3EN_SHIFT               (28U)
#define EIM_2_EICHEN_EICH3EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH3EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH3EN_SHIFT)) & EIM_2_EICHEN_EICH3EN_MASK)

#define EIM_2_EICHEN_EICH1EN_MASK                (0x40000000U)
#define EIM_2_EICHEN_EICH1EN_SHIFT               (30U)
#define EIM_2_EICHEN_EICH1EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH1EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH1EN_SHIFT)) & EIM_2_EICHEN_EICH1EN_MASK)

#define EIM_2_EICHEN_EICH0EN_MASK                (0x80000000U)
#define EIM_2_EICHEN_EICH0EN_SHIFT               (31U)
#define EIM_2_EICHEN_EICH0EN_WIDTH               (1U)
#define EIM_2_EICHEN_EICH0EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHEN_EICH0EN_SHIFT)) & EIM_2_EICHEN_EICH0EN_MASK)
/*! @} */

/*! @name EICHD0_WORD0 - Error Injection Channel Descriptor 0, Word0 */
/*! @{ */

#define EIM_2_EICHD0_WORD0_CHKBIT_MASK_MASK      (0xFF000000U)
#define EIM_2_EICHD0_WORD0_CHKBIT_MASK_SHIFT     (24U)
#define EIM_2_EICHD0_WORD0_CHKBIT_MASK_WIDTH     (8U)
#define EIM_2_EICHD0_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD0_WORD0_CHKBIT_MASK_SHIFT)) & EIM_2_EICHD0_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD0_WORD1 - Error Injection Channel Descriptor 0, Word1 */
/*! @{ */

#define EIM_2_EICHD0_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD0_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD0_WORD1_B0_3DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD0_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD0_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD0_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD0_WORD2 - Error Injection Channel Descriptor 0, Word2 */
/*! @{ */

#define EIM_2_EICHD0_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD0_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD0_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD0_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD0_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD0_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD0 - Error Injection Channel Descriptor 1, Word0 */
/*! @{ */

#define EIM_2_EICHD1_WORD0_CHKBIT_MASK_MASK      (0xFF000000U)
#define EIM_2_EICHD1_WORD0_CHKBIT_MASK_SHIFT     (24U)
#define EIM_2_EICHD1_WORD0_CHKBIT_MASK_WIDTH     (8U)
#define EIM_2_EICHD1_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD1_WORD0_CHKBIT_MASK_SHIFT)) & EIM_2_EICHD1_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD1 - Error Injection Channel Descriptor 1, Word1 */
/*! @{ */

#define EIM_2_EICHD1_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD1_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD1_WORD1_B0_3DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD1_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD1_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD1_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD2 - Error Injection Channel Descriptor 1, Word2 */
/*! @{ */

#define EIM_2_EICHD1_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD1_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD1_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD1_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD1_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD1_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD0 - Error Injection Channel Descriptor 3, Word0 */
/*! @{ */

#define EIM_2_EICHD3_WORD0_CHKBIT_MASK_MASK      (0xFF000000U)
#define EIM_2_EICHD3_WORD0_CHKBIT_MASK_SHIFT     (24U)
#define EIM_2_EICHD3_WORD0_CHKBIT_MASK_WIDTH     (8U)
#define EIM_2_EICHD3_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD3_WORD0_CHKBIT_MASK_SHIFT)) & EIM_2_EICHD3_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD1 - Error Injection Channel Descriptor 3, Word1 */
/*! @{ */

#define EIM_2_EICHD3_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD3_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD3_WORD1_B0_3DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD3_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD3_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD3_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD2 - Error Injection Channel Descriptor 3, Word2 */
/*! @{ */

#define EIM_2_EICHD3_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD3_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD3_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD3_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD3_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD3_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD0 - Error Injection Channel Descriptor 4, Word0 */
/*! @{ */

#define EIM_2_EICHD4_WORD0_CHKBIT_MASK_MASK      (0xFF000000U)
#define EIM_2_EICHD4_WORD0_CHKBIT_MASK_SHIFT     (24U)
#define EIM_2_EICHD4_WORD0_CHKBIT_MASK_WIDTH     (8U)
#define EIM_2_EICHD4_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD4_WORD0_CHKBIT_MASK_SHIFT)) & EIM_2_EICHD4_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD1 - Error Injection Channel Descriptor 4, Word1 */
/*! @{ */

#define EIM_2_EICHD4_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD4_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD4_WORD1_B0_3DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD4_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD4_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD4_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD2 - Error Injection Channel Descriptor 4, Word2 */
/*! @{ */

#define EIM_2_EICHD4_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD4_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD4_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD4_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD4_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD4_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

