zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_EIM_2.h
/*! @name EICHD8_WORD1 - Error Injection Channel Descriptor 8, Word1 */
/*! @{ */

#define EIM_2_EICHD8_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFU)
#define EIM_2_EICHD8_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD8_WORD1_B0_3DATA_MASK_WIDTH   (28U)
#define EIM_2_EICHD8_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD8_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD8_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD8_WORD2 - Error Injection Channel Descriptor 8, Word2 */
/*! @{ */

#define EIM_2_EICHD8_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD8_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD8_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD8_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD8_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD8_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD9_WORD1 - Error Injection Channel Descriptor 9, Word1 */
/*! @{ */

#define EIM_2_EICHD9_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFU)
#define EIM_2_EICHD9_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD9_WORD1_B0_3DATA_MASK_WIDTH   (28U)
#define EIM_2_EICHD9_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD9_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD9_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD9_WORD2 - Error Injection Channel Descriptor 9, Word2 */
/*! @{ */

#define EIM_2_EICHD9_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD9_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD9_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD9_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD9_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD9_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD10_WORD1 - Error Injection Channel Descriptor 10, Word1 */
/*! @{ */

#define EIM_2_EICHD10_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD10_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD10_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD10_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD10_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD10_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD10_WORD2 - Error Injection Channel Descriptor 10, Word2 */
/*! @{ */

#define EIM_2_EICHD10_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD10_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD10_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD10_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD10_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD10_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD11_WORD1 - Error Injection Channel Descriptor 11, Word1 */
/*! @{ */

#define EIM_2_EICHD11_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD11_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD11_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD11_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD11_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD11_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD11_WORD2 - Error Injection Channel Descriptor 11, Word2 */
/*! @{ */

#define EIM_2_EICHD11_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD11_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD11_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD11_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD11_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD11_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD12_WORD1 - Error Injection Channel Descriptor 12, Word1 */
/*! @{ */

#define EIM_2_EICHD12_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD12_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD12_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD12_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD12_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD12_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD12_WORD2 - Error Injection Channel Descriptor 12, Word2 */
/*! @{ */

#define EIM_2_EICHD12_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD12_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD12_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD12_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD12_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD12_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD13_WORD1 - Error Injection Channel Descriptor 13, Word1 */
/*! @{ */

#define EIM_2_EICHD13_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD13_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD13_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD13_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD13_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD13_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD13_WORD2 - Error Injection Channel Descriptor 13, Word2 */
/*! @{ */

#define EIM_2_EICHD13_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD13_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD13_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD13_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD13_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD13_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD14_WORD1 - Error Injection Channel Descriptor 14, Word1 */
/*! @{ */

#define EIM_2_EICHD14_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD14_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD14_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD14_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD14_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD14_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD14_WORD2 - Error Injection Channel Descriptor 14, Word2 */
/*! @{ */

#define EIM_2_EICHD14_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD14_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD14_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD14_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD14_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD14_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

