zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_EIM_2.h
/*! @name EICHD15_WORD1 - Error Injection Channel Descriptor 15, Word1 */
/*! @{ */

#define EIM_2_EICHD15_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD15_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD15_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD15_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD15_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD15_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD15_WORD2 - Error Injection Channel Descriptor 15, Word2 */
/*! @{ */

#define EIM_2_EICHD15_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD15_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD15_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD15_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD15_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD15_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD16_WORD1 - Error Injection Channel Descriptor 16, Word1 */
/*! @{ */

#define EIM_2_EICHD16_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD16_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD16_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD16_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD16_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD16_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD16_WORD2 - Error Injection Channel Descriptor 16, Word2 */
/*! @{ */

#define EIM_2_EICHD16_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD16_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD16_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD16_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD16_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD16_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD17_WORD1 - Error Injection Channel Descriptor 17, Word1 */
/*! @{ */

#define EIM_2_EICHD17_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD17_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD17_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD17_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD17_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD17_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD17_WORD2 - Error Injection Channel Descriptor 17, Word2 */
/*! @{ */

#define EIM_2_EICHD17_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD17_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD17_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD17_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD17_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD17_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD18_WORD1 - Error Injection Channel Descriptor 18, Word1 */
/*! @{ */

#define EIM_2_EICHD18_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD18_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD18_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD18_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD18_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD18_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD18_WORD2 - Error Injection Channel Descriptor 18, Word2 */
/*! @{ */

#define EIM_2_EICHD18_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD18_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD18_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD18_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD18_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD18_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD21_WORD1 - Error Injection Channel Descriptor 21, Word1 */
/*! @{ */

#define EIM_2_EICHD21_WORD1_B0_3DATA_MASK_MASK   (0xFFU)
#define EIM_2_EICHD21_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD21_WORD1_B0_3DATA_MASK_WIDTH  (8U)
#define EIM_2_EICHD21_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD21_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD21_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD22_WORD1 - Error Injection Channel Descriptor 22, Word1 */
/*! @{ */

#define EIM_2_EICHD22_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD22_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD22_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD22_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD22_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD22_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD22_WORD2 - Error Injection Channel Descriptor 22, Word2 */
/*! @{ */

#define EIM_2_EICHD22_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD22_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD22_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD22_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD22_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD22_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD22_WORD3 - Error Injection Channel Descriptor 22, Word3 */
/*! @{ */

#define EIM_2_EICHD22_WORD3_B8_11DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_2_EICHD22_WORD3_B8_11DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD22_WORD3_B8_11DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD22_WORD3_B8_11DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD22_WORD3_B8_11DATA_MASK_SHIFT)) & EIM_2_EICHD22_WORD3_B8_11DATA_MASK_MASK)
/*! @} */

/*! @name EICHD22_WORD4 - Error Injection Channel Descriptor 22, Word4 */
/*! @{ */

#define EIM_2_EICHD22_WORD4_B12_15DATA_MASK_MASK (0xFFFFFFFFU)
#define EIM_2_EICHD22_WORD4_B12_15DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD22_WORD4_B12_15DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD22_WORD4_B12_15DATA_MASK(x)   (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD22_WORD4_B12_15DATA_MASK_SHIFT)) & EIM_2_EICHD22_WORD4_B12_15DATA_MASK_MASK)
/*! @} */

/*! @name EICHD22_WORD5 - Error Injection Channel Descriptor 22, Word5 */
/*! @{ */

#define EIM_2_EICHD22_WORD5_B16_19DATA_MASK_MASK (0xFFFFFFFFU)
#define EIM_2_EICHD22_WORD5_B16_19DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD22_WORD5_B16_19DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD22_WORD5_B16_19DATA_MASK(x)   (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD22_WORD5_B16_19DATA_MASK_SHIFT)) & EIM_2_EICHD22_WORD5_B16_19DATA_MASK_MASK)
/*! @} */

/*! @name EICHD22_WORD6 - Error Injection Channel Descriptor 22, Word6 */
/*! @{ */

