zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_EIM_2.h
#define EIM_2_EICHD22_WORD6_B20_23DATA_MASK_MASK (0xFFFFFFFFU)
#define EIM_2_EICHD22_WORD6_B20_23DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD22_WORD6_B20_23DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD22_WORD6_B20_23DATA_MASK(x)   (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD22_WORD6_B20_23DATA_MASK_SHIFT)) & EIM_2_EICHD22_WORD6_B20_23DATA_MASK_MASK)
/*! @} */

/*! @name EICHD23_WORD0 - Error Injection Channel Descriptor 23, Word0 */
/*! @{ */

#define EIM_2_EICHD23_WORD0_CHKBIT_MASK_MASK     (0xFE000000U)
#define EIM_2_EICHD23_WORD0_CHKBIT_MASK_SHIFT    (25U)
#define EIM_2_EICHD23_WORD0_CHKBIT_MASK_WIDTH    (7U)
#define EIM_2_EICHD23_WORD0_CHKBIT_MASK(x)       (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD23_WORD0_CHKBIT_MASK_SHIFT)) & EIM_2_EICHD23_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD23_WORD1 - Error Injection Channel Descriptor 23, Word1 */
/*! @{ */

#define EIM_2_EICHD23_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD23_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD23_WORD1_B0_3DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD23_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD23_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD23_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD24_WORD0 - Error Injection Channel Descriptor 24, Word0 */
/*! @{ */

#define EIM_2_EICHD24_WORD0_CHKBIT_MASK_MASK     (0xFC000000U)
#define EIM_2_EICHD24_WORD0_CHKBIT_MASK_SHIFT    (26U)
#define EIM_2_EICHD24_WORD0_CHKBIT_MASK_WIDTH    (6U)
#define EIM_2_EICHD24_WORD0_CHKBIT_MASK(x)       (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD24_WORD0_CHKBIT_MASK_SHIFT)) & EIM_2_EICHD24_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD24_WORD1 - Error Injection Channel Descriptor 24, Word1 */
/*! @{ */

#define EIM_2_EICHD24_WORD1_B0_3DATA_MASK_MASK   (0xFFFFU)
#define EIM_2_EICHD24_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD24_WORD1_B0_3DATA_MASK_WIDTH  (16U)
#define EIM_2_EICHD24_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD24_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD24_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD25_WORD0 - Error Injection Channel Descriptor 25, Word0 */
/*! @{ */

#define EIM_2_EICHD25_WORD0_CHKBIT_MASK_MASK     (0xFC000000U)
#define EIM_2_EICHD25_WORD0_CHKBIT_MASK_SHIFT    (26U)
#define EIM_2_EICHD25_WORD0_CHKBIT_MASK_WIDTH    (6U)
#define EIM_2_EICHD25_WORD0_CHKBIT_MASK(x)       (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD25_WORD0_CHKBIT_MASK_SHIFT)) & EIM_2_EICHD25_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD25_WORD1 - Error Injection Channel Descriptor 25, Word1 */
/*! @{ */

#define EIM_2_EICHD25_WORD1_B0_3DATA_MASK_MASK   (0xFFFFU)
#define EIM_2_EICHD25_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD25_WORD1_B0_3DATA_MASK_WIDTH  (16U)
#define EIM_2_EICHD25_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD25_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD25_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD26_WORD1 - Error Injection Channel Descriptor 26, Word1 */
/*! @{ */

#define EIM_2_EICHD26_WORD1_B0_3DATA_MASK_MASK   (0x3FFU)
#define EIM_2_EICHD26_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD26_WORD1_B0_3DATA_MASK_WIDTH  (10U)
#define EIM_2_EICHD26_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD26_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD26_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD27_WORD1 - Error Injection Channel Descriptor 27, Word1 */
/*! @{ */

#define EIM_2_EICHD27_WORD1_B0_3DATA_MASK_MASK   (0xFU)
#define EIM_2_EICHD27_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD27_WORD1_B0_3DATA_MASK_WIDTH  (4U)
#define EIM_2_EICHD27_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD27_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD27_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD28_WORD1 - Error Injection Channel Descriptor 28, Word1 */
/*! @{ */

#define EIM_2_EICHD28_WORD1_B0_3DATA_MASK_MASK   (0xFFU)
#define EIM_2_EICHD28_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD28_WORD1_B0_3DATA_MASK_WIDTH  (8U)
#define EIM_2_EICHD28_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD28_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD28_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD29_WORD1 - Error Injection Channel Descriptor 29, Word1 */
/*! @{ */

#define EIM_2_EICHD29_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_2_EICHD29_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD29_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_2_EICHD29_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD29_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD29_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD30_WORD1 - Error Injection Channel Descriptor 30, Word1 */
/*! @{ */

#define EIM_2_EICHD30_WORD1_B0_3DATA_MASK_MASK   (0x3FFFFU)
#define EIM_2_EICHD30_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD30_WORD1_B0_3DATA_MASK_WIDTH  (18U)
#define EIM_2_EICHD30_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD30_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD30_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD31_WORD1 - Error Injection Channel Descriptor 31, Word1 */
/*! @{ */

#define EIM_2_EICHD31_WORD1_B0_3DATA_MASK_MASK   (0x3FFFFU)
#define EIM_2_EICHD31_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD31_WORD1_B0_3DATA_MASK_WIDTH  (18U)
#define EIM_2_EICHD31_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD31_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD31_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group EIM_2_Register_Masks */

/*!
 * @}
 */ /* end of group EIM_2_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K39_EIM_2_H_) */
